tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/opt/tsung/share/tsung/tsung-1.0.dtd">
<tsung loglevel="info" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="1000"/>
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="minute">
      <users maxnumber="1000" interarrival="2" unit="second"/>
    </arrivalphase>
            <!--
    <arrivalphase phase="2" duration="10" unit="minute">
      <users maxnumber="1000" interarrival="2" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="3" duration="10" unit="minute">
      <users maxnumber="1000" interarrival="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="1" duration="10" unit="minute">
      <users maxnumber="1000" interarrival="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="minute">
      <users maxnumber="1000" interarrival="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="minute">
      <users maxnumber="1000" interarrival="1" unit="second"/>
    </arrivalphase>
    -->
  </load>

  <options>
    <option name="file_server" id="userdb" value="/Users/alyttle/.tsung/users_2017-11-27.txt"/>
    <option type="ts_http" name="user_agent">
      <user_agent probability="50">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21
      </user_agent>
      <user_agent probability="50">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http_test_logout" probability="99" type="ts_http">

      <setdynvars sourcetype="file" fileid="userdb" order="iter">
        <var name="user"/>
      </setdynvars>

      <transaction name="api_endpoints">
        <request>
          <http url="http://localhost:3000/" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/assets/stylesheets/application.css" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/assets/javascripts/application.js" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/assets/images/splash_cfv_625x415.png" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/status" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/am_i_logged_in" version="1.1" method="GET"/>
        </request>

        <thinktime random="true" value="2"/>

        <request subst="true">
          <http url="http://localhost:3000/basic_auth_login" version="1.1" method="GET">
            <www_authenticate userid="%%_user%%" passwd="topsecret!"/>
          </http>
        </request>

        <request>
          <http url="/dashboard" version="1.1" method="GET"/>
        </request>

        <request>
          <http url="/api/my/status" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/badges" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/activities" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/classes" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/up_next" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/tasks" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/groups" version="1.1" method="GET"/>
        </request>

        <thinktime random="true" value="2"/>

        <request>
          <http url="/api/my/status" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/am_i_logged_in" version="1.1" method="GET"/>
        </request>

        <thinktime random="true" value="2"/>

        <request>
          <http url="/api/my/am_i_logged_in" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/campuslinks" version="1.1" method="GET"/>
        </request>

        <thinktime random="true" value="2"/>

        <request>
          <http url="/api/my/am_i_logged_in" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/financials" version="1.1" method="GET"/>
        </request>

        <thinktime random="true" value="2"/>

        <request>
          <http url="/api/my/am_i_logged_in" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/academics" version="1.1" method="GET"/>
        </request>

        <thinktime random="true" value="2"/>

        </transaction>

      <thinktime random="false" value="10"/>

      <transaction name="refetch_api_endpoints">
        <request>
          <http url="/api/my/updated_feeds" version="1.1" method="GET"/>
        </request>

        <request>
          <http url="/api/my/status" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/badges" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/activities" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/classes" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/up_next" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/tasks" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/groups" version="1.1" method="GET"/>
        </request>
      </transaction>

      <thinktime random="false" value="60"/>

      <transaction name="second_refetch_api_endpoints">
        <request>
          <http url="/api/my/updated_feeds" version="1.1" method="GET"/>
        </request>

        <request>
          <http url="/api/my/status" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/badges" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/activities" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/classes" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/up_next" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/tasks" version="1.1" method="GET"/>
        </request>
        <request>
          <http url="/api/my/groups" version="1.1" method="GET"/>
        </request>
      </transaction>

      <request>
        <http url="/logout" version="1.1" method="GET"/>
      </request>

    </session>

    <session name="http_test_ping" probability="1" type="ts_http">

      <transaction name="api_ping">
        <request>
          <http url="http://localhost:3000/api/ping" version="1.1" method="GET"/>
        </request>
      </transaction>

    </session>

  </sessions>

</tsung>